Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Waits 1 second before continuing execution.
ja: 実行を続ける前に1秒待つ。

source: Waits 30 minutes before continuing execution.
ja: 実行を続ける前に30分待つ。

source: Waits for a Notepad process to appear.
ja: メモ帳のプロセスが起動するのを待ちます。

source: Waits for a certain window to appear and then alerts the user.
ja: 特定のウィンドウが表示されるのを待ち、ユーザーに警告を発する。

source: Waits for a key or mouse/joystick button to be released or pressed down.
ja: キーやマウス・ジョイスティックボタンが離されたり、押し下げられたりするのを待ちます。

source: Waits for all matching processes to close.
ja: すべてのマッチング処理が終了するのを待ちます。

source: Waits for any key in combination with Ctrl/Alt/Shift/Win.
ja: Ctrl/Alt/Shift/Winと組み合わせた任意のキーで待機します。

source: Waits for the A key to be released.
ja: Aキーが解放されるのを待ちます。

source: Waits for the left Alt key to be logically released.
ja: 左Altキーが論理的に解除されるのを待ちます。

source: Waits for the left mouse button to be pressed down.
ja: マウスの左ボタンが押し下げられるのを待ちます。

source: Waits for the specified process to exist.
ja: 指定されたプロセスが存在するのを待ちます。

source: Waits for the status bar of the active window to change.
ja: アクティブウィンドウのステータスバーが変わるのを待つ。

source: Waits for the user to press any single key.
ja: ユーザーが任意の1つのキーを押すのを待ちます。

source: Waits the specified amount of time before continuing.
ja: 指定された時間だけ待ってから続行します。

source: Waits until a window's status bar contains the specified string.
ja: ウィンドウのステータスバーに指定された文字列が含まれるまで待ちます。

source: Waits until no matching windows can be found.
ja: 一致するウィンドウが見つからなくなるまで待ちます。

source: Waits until the clipboard contains data.
ja: クリップボードにデータが入るまで待ちます。

source: Waits until the Input is terminated (InProgress is false).
ja: Inputが終了するまで待機する（InProgressがfalse）。

source: Waits until the specified window exists.
ja: 指定されたウィンドウが存在するまで待ちます。

source: Waits until the specified window is active or not active.
ja: 指定されたウィンドウがアクティブになるまで、またはアクティブでなくなるまで待ちます。

source: Waits up to 3 seconds for the first joystick button to be pressed down.
ja: ジョイスティックの最初のボタンが押し下げられるまで、最大3秒待ちます。

source: Waits up to 5.5 seconds for Notepad to appear.
ja: メモ帳が表示されるまで、最大5.5秒待ちます。

source: Watch user-specified variables.
ja: ユーザー指定の変数を見る。

source: We can also use this.timer := this.Tick.Bind(this).
ja: また、this.timer := this.Tick.Bind(this)を使用することもできます。

source: We can do that.
ja: それはできる。

source: We can use this to make our Notepad example more reliable by ensuring that it ignores any Notepad window except the one that is created by the new process:
ja: これを利用して、新しいプロセスによって作成される以外のメモ帳ウィンドウを無視するようにすることで、メモ帳の例をより信頼性の高いものにすることができます：

source: We did not need curly brackets since there was only one line below it."
ja: の下に1行しかないので、中カッコは必要なかった。"

source: We have reached the end of our journey, my good friend.
ja: 我々は旅の終わりに到達したのだ。

source: We love to help, but we also do this for free on our own time.
ja: 私たちは手助けをするのが好きだが、自分の時間を使って無料でやっている。

source: We might be at work, sleeping, gaming, with family or just too busy to help.
ja: 仕事中かもしれないし、寝ているかもしれないし、ゲームをしているかもしれないし、家族と一緒にいるかもしれないし、ただ忙しくて手伝う暇がないかもしれない。

source: We need three commas in a row; two of them are just to skip the unused WorkingDir and Options parameters of the Run function, since the one we want (OutputVarPID) is the fourth parameter.
ja: そのうちの2つは、Run関数の未使用のWorkingDirと Optionsパラメータをスキップするためで、必要なもの（OutputVarPID）は、第4パラメータだからです。

source: We protect your rights with two steps:
ja: 私たちは2つのステップであなたの権利を守ります：

source: We protect your rights with two steps: (1) copyright the software, and (2) offer you this license which gives you legal permission to copy, distribute and/or modify the software.
ja: 私たちは2つのステップであなたの権利を守ります：(1) 本ソフトウェアの著作権、(2) 本ソフトウェアを複製、頒布、および/または変更する法的許可を与える本ライセンスの提供。

source: We refer to a menu created by one of these functions as a Win32 menu.
ja: これらの関数を用いて作成されたメニューをWin32メニューと呼ぶことにします。

source: We take one step at a time, and when that step is finished, we move on to the next step.
ja: 一歩ずつ進んで、その一歩が終わったら次のステップに進む。

source: We use obj.base in place of JavaScript's obj.__proto__ and cls.Prototype in place of JavaScript's func.prototype.
ja: JavaScriptのobj.__proto__の代わりにobj.baseを使い、JavaScriptのfunc.prototypeの代わりにcls.Prototypeを使います。

source: We will get more in-depth later on.
ja: 後でもっと詳しく説明します。

source: We wish to avoid the danger that redistributors of a free program will individually obtain patent licenses, in effect making the program proprietary.
ja: わたしたちは、自由なプログラムの再配布者が個々に特許ライセンスを取得し、事実上そのプログラムをプロプライエタリなものにしてしまう危険を避けたいのです。

source: We won't go into detail about many of the functions for manipulating windows, since there's not much to it.
ja: ウィンドウを操作するための関数の多くは、それほど多くないので詳しく説明しません。

source: We'll address these issues one at a time, after covering a few basics.
ja: 基本を押さえた上で、ひとつずつ解決していきます。

source: We'll cover the most common forms.
ja: ここでは、最も一般的な形式を取り上げる。

source: We're taking a shortcut by using the name of the variable to refer to its value, but "myArray" is really just the name of the variable; the array object doesn't know that it has a name, and could be referred to by many different variables (and therefore many names).
ja: しかし、「myArray」は単なる変数名であり、配列オブジェクトは自分が名前を持っていることを知らないので、多くの異なる変数（したがって多くの名前）で参照される可能性があるのです。

source: Web Browsers
ja: ウェブブラウザ

source: Web Folders
ja: ウェブフォルダ

source: Week 1 is defined as the first week that contains at least four days.
ja: 第1週は、少なくとも4日間を含む最初の週と定義される。

source: Weight (boldness), which is a number between 1 and 1000 (400 is normal and 700 is bold).
ja: ウェイト（太字）、1～1000の数値（400が普通、700が太字）。

source: Well, good question.
ja: いい質問だね。

source: What can I do if AutoHotkey won't install?
ja: AutoHotkeyがインストールできないときは、どうすればよいですか？

source: What do I do?
ja: どうすればいいのでしょうか？

source: What if you wanted to use ExcludeTitle but not fill in WinText or WinTitle?
ja: WinTextや WinTitleを記入せず、ExcludeTitleを使いたい場合は？

source: What is a hotkey?
ja: ホットキーとは何ですか？

source: What is a hotstring?
ja: ホットストリングとは？

source: What should I do?
ja: どうすればよいですか？

source: What the Function Should Return
ja: 関数が返すべきもの

source: What will you do?
ja: どうするつもりだ？

source: What you want to look for (usually) is a code 0 message.
ja: 探したいのは（通常は）コード0のメッセージだ。

source: Whatever program is capturing the output must support UTF-8, and in some cases may need to be configured to expect it.
ja: 出力をキャプチャするプログラムは、UTF-8をサポートしている必要があり、場合によってはUTF-8を期待するように設定する必要があることもあります。

source: Wheel
ja: ホイール

source: WheelLeft (or WL) or WheelRight (or WR) may also be specified.
ja: WheelLeft（またはWL）またはWheelRight（またはWR）を指定することもできる。

source: WheelUp (or WU), WheelDown (or WD), WheelLeft (or WL) and WheelRight (or WR) are also supported.
ja: WheelUp（WU）、WheelDown（WD）、WheelLeft（WL）、WheelRight（WR）にも対応しています。

source: WheelUp::Send "{Volume_Up}" ; Wheel over taskbar: increase/decrease volume.
ja: WheelUp::Send "{Volume_Up}" ; タスクバー上のホイール：音量の増加/減少。

source: When #HotIf directives are never used in a script, all hotkeys and hotstrings are enabled for all windows.
ja: スクリプト内で#HotIfディレクティブが使用されていない場合、すべてのウィンドウですべてのホットキーとホットストリングが有効になります。

source: When 1 (true) is present as the last parameter, the function will be satisfied when any data appears on the clipboard.
ja: 最後のパラメータに1（true）を指定すると、クリップボードに何らかのデータが表示されたときに、この関数が満たされます。

source: When 1 is present as the last parameter, the function will be satisfied when any data appears on the clipboard.
ja: 最後のパラメータに1を指定すると、クリップボードに何らかのデータが表示されたときに、この関数が満たされます。

source: When WinWait, WinExist, WinActive, WinWaitActive or WinWaitNotActive find a matching window, they set it as the last found window.
ja: WinWait、WinExist、WinActive、WinWaitActive、WinWaitNotActiveは、一致するウィンドウを見つけると、そのウィンドウを ラストファウンドウインドウに設定します。

source: When adding a row, specify the word Check in its options to have the box to start off checked instead of unchecked.
ja: 行を追加する際、そのオプションにCheckという単語を指定すると、スタートするボックスがチェックされていない状態ではなく、チェックされた状態になります。

source: When adding an item, specify the word Check in its options to have the box to start off checked instead of unchecked.
ja: 項目を追加する際、オプションにCheckという単語を指定すると、チェックされていないボックスではなく、チェックされたボックスが開始されます。

source: When . is used for continuation, the two lines are no longer automatically delimited by a space if there was no space or tab to the right of . at the start of a line, as in .VeryLongNestedClassName.
ja: .VeryLongNestedClassNameのように、行頭で.の右側にスペースやタブがなかった場合、継続に.が使われると、2つの行は自動的にスペースで区切られなくなります。

source: When A is initialized first, evaluating B.SharedArray (A1) causes B to be initialized before retrieving and returning the value, but A.SharedValue (A3) is undefined and does not cause initialization of A because it is already in progress.
ja: Aが最初に初期化されるときは、B.SharedArray（A1）を評価すると、値を取得して返す前にBが初期化されますが、A.SharedValue（A3）は未定義であり、すでに進行中のためAの初期化は起こりません。

source: When thing.test() is called, thing is automatically inserted at the beginning of the parameter list.
ja: thing.test()が呼ばれると、thingは自動的にパラメータ・リストの先頭に挿入される。

source: When other.test() is called, its this parameter contains a reference to other instead of thing.
ja: other.test()が呼び出されると、thisパラメータにはthingの代わりにotherへの参照が含まれる。

source: When this.timer is called, it will effectively invoke tick_function.Call(this), where tick_function is the function object which implements that method.
ja: this.timerが呼び出されると、実質的にtick_function.Call(this)が呼び出されます。tick_functionはそのメソッドを実装した関数オブジェクトです。

source: When AND, OR, and the ternary operator are used within an expression, they short-circuit to enhance performance (regardless of whether any function calls are present).
ja: AND、OR、三項演算子を式中で使用すると、（関数呼び出しの有無にかかわらず）性能を向上させるために短絡させることができます。

source: When Default is omitted, this is equivalent to ArrayObj[Index], except that __Item is not called.
ja: Defaultが省略された場合、__Itemが呼び出されないことを除いてArrayObj[Index]と同等となる。

source: When Default is omitted, this is equivalent to MapObj[Key], except that __Item is not called.
ja: Defaultが省略された場合、__Itemが呼び出されないことを除けばMapObj[Key]と同等である。

source: When Expr evaluates to a VarRef, %Expr% accesses the corresponding variable.
ja: Exprが VarRefに評価されると、%Expr%は対応する変数にアクセスする。

source: When Format contains a numeric day of the month (either d or dd) followed by the full month name (MMMM), the genitive form of the month name is used (if the language has a genitive form).
ja: Formatに数値の月日（dまたはdd）の後に完全な月名（MMMM）が含まれる場合、月名の主格が使用される（言語に主格がある場合）。

source: When KeyName is JoyPOV, this function returns an integer between 0 and 35900.
ja: KeyNameがJoyPOVの場合、0～35900の整数を返す。

source: When KeyName is a joystick axis such as JoyX, this function returns a floating-point number between 0 and 100 to indicate the joystick's position as a percentage of that axis's range of motion.
ja: KeyNameがJoyXなどのジョイスティック軸の場合、ジョイスティックの位置をその軸の可動範囲に対する割合で示す0〜100の浮動小数点数を返す。

source: When KeyName is omitted and the current loop reg item is a subkey, RegDelete, RegRead and RegWrite now operate on values within that subkey; i.e. KeyName defaults to A_LoopRegKey "\" A_LoopRegName in that case (note that A_LoopRegKey was merged with A_LoopRegSubKey).
ja: KeyNameが省略され、現在のループREGアイテムがサブキーである場合、RegDelete、RegRead、RegWriteはそのサブキー内の値に対して動作するようになりました。つまり、KeyNameのデフォルトはA_LoopRegKey "\" A_LoopRegNameです（A_LoopRegKeyはA_LoopRegSubKeyに統合されているので注意してください）。

source: When ParamCount is specified, the validation this function performs is equivalent to the validation performed by built-in functions such as SetTimer.
ja: ParamCountを指定した場合、SetTimerなどの組み込み関数が行う検証と同等になります。

source: When Source is extracted from the EXE, this is the name of the file to be created.
ja: EXEからSourceを展開する際に、作成されるファイル名です。

source: When Backspace acts as undo, it is treated as a text entry key.
ja: Backspaceがアンドゥとして機能する場合、テキスト入力キーとして扱われます。

source: When AutoHotkey uses these functions to work with external windows, this often produces unexpected results if the coordinates are not on the primary screen.
ja: AutoHotkeyがこれらの関数を使用して外部ウィンドウを操作する場合、座標がプライマリスクリーン上にない場合、しばしば予期しない結果が生じます。

source: When AutoHotkey_L is launched without specifying a script, an .ahk file is loaded by default instead of an .ini file.
ja: スクリプトを指定せずにAutoHotkey_Lを起動した場合、.iniファイルではなく、.ahkファイルがデフォルトで読み込まれる。

source: When BlockInput is in effect, user input is blocked but AutoHotkey can simulate keystrokes and mouse clicks.
ja: BlockInputが有効な場合、ユーザー入力はブロックされますが、AutoHotkeyはキーストロークやマウスクリックをシミュレートできます。

source: When DllCall updates the length of a variable passed as Str or WStr, it now detects if the string was not properly null-terminated (likely indicating that buffer overrun has occurred), and terminates the program with an error message if so, as safe execution cannot be guaranteed.
ja: DllCallがStrまたはWStrとして渡された変数の長さを更新するとき、文字列が適切にヌル終端されていないかどうかを検出し（バッファオーバーランが発生した可能性が高い）、安全な実行が保証されないため、エラーメッセージでプログラムを終了させるようにしました。

source: When NumPut or NumGet are used with strings, the offset and type must be correct for the given type of string.
ja: NumPutまたはNumGetが文字列と共に使用される場合、オフセットと型は与えられた文字列の型に対して正しくなければならない。

source: When SID and IID are both specified, it internally queries for the IServiceProvider interface, then calls IServiceProvider::QueryService.
ja: SID と IID の両方が指定された場合、内部でIServiceProviderインターフェースの問い合わせを行い、IServiceProvider::QueryServiceを呼び出します。

source: When Send is required to change the state of the Win or Alt modifier keys (such as if the user was holding one of those keys), it may inject additional keystrokes (Ctrl by default) to prevent the Start menu or window menu from appearing.
ja: Sendは、WinまたはAlt修飾キーの状態を変更する必要がある場合（ユーザーがこれらのキーのいずれかを保持している場合など）、スタートメニューやウィンドウメニューが表示されないようにするために追加のキーストローク（デフォルトではCtrl）を注入することができます。

source: When SendInput is unavailable, hotstrings automatically use SendPlay instead.
ja: SendInputが利用できない場合、ホットストリングは自動的にSendPlayを代わりに使用します。

source: When SendInput reverts to SendPlay, it uses SendPlay's KeyDelay.
ja: SendInputがSendPlayに戻ると、SendPlayのKeyDelayを使用します。

source: When SendInput sends mouse clicks by means such as {Click}, and CoordMode "Mouse", "Window" or CoordMode "Mouse", "Client" is in effect, every click will be relative to the window that was active at the start of the send.
ja: SendInputが{Click}などの手段でマウスクリックを送信し、CoordMode "Mouse", "Window"またはCoordMode "Mouse", "Client"が有効な場合、すべてのクリックは、送信開始時にアクティブだったウィンドウに対する相対移動となります。

source: When __Delete is called during this process, some global or static variables may have already been released, but any references contained by the object itself are still valid.
ja: この処理中に__Deleteが呼ばれた場合、グローバル変数やスタティック変数はすでに解放されている可能性があるが、オブジェクト自身が含む参照はまだ有効である。

source: When a bound function is called, parameters passed by the caller fill in any positions that were omitted when creating the bound function.
ja: バウンド関数が呼び出されると、呼び出し元から渡されたパラメータが、バウンドファンクションの作成時に省略された位置を埋めます。

source: When a GUI is destroyed, all event callbacks are released.
ja: GUIが破壊されると、すべてのイベントコールバックが解放されます。

source: When a ListBox, ListView, or TreeView is the target of the context menu (as determined by GuiCtrlObj), Item specifies which of the control's items is the target.
ja: ListBox、ListView、TreeViewがコンテキストメニューのターゲットである場合（GuiCtrlObjで決定）、Itemはコントロールのどのアイテムをターゲットとするかを指定します。

source: When a UTF-8 or UTF-16 file is created, a byte order mark is written to the file unless Encoding (or A_FileEncoding if Encoding is omitted) contains UTF-8-RAW or UTF-16-RAW.
ja: UTF-8またはUTF-16のファイルを作成する場合、Encoding（Encodingを省略した場合はA_FileEncoding）がUTF-8-RAWまたはUTF-16-RAWを含まない限り、バイト順マークがファイルに書き込まれます。

source: When a VarRef is used as a parameter of a COM method, the object itself is not passed.
ja: VarRefをCOMメソッドのパラメータとして使用する場合、オブジェクトそのものは渡されません。

source: When a call to this function is read by Ahk2Exe during compilation of the script, the file specified by Source is added to the resulting compiled script.
ja: この関数の呼び出しがスクリプトのコンパイル中にAhk2Exeによって読み込まれると、Sourceで指定されたファイルがコンパイル後のスクリプトに追加されます。

source: When a control is created using this style, it automatically creates a default ToolTip control that displays the slider's current position.
ja: このスタイルを使用してコントロールが作成されると、スライダーの現在位置を表示するデフォルトの ToolTip コントロールが自動的に作成されます。

source: When a control is focused in response to user input (such as pressing the Tab key), the dialog manager applies additional effects which are independent of the control having focus.
ja: ユーザー入力（Tabキーなど）に応じてコントロールがフォーカスされると、ダイアログマネージャーは、フォーカスを持つコントロールとは独立した追加効果を適用します。

source: When a file containing a UTF-8 or UTF-16 byte order mark (BOM) is opened with read access, the BOM is excluded from the output by positioning the file pointer after it.
ja: UTF-8またはUTF-16のバイトオーダーマーク（BOM）を含むファイルを読み込みアクセスで開いた場合、ファイルポインタをBOMの後に配置することで出力から除外されるようにしました。

source: When a function is defined, its parameters are listed in parentheses next to its name (there must be no spaces between its name and the open-parenthesis).
ja: 関数を定義すると、そのパラメータが名前の横の括弧に記載されます（名前と括弧の間に空白があってはいけません）。

source: When a function or method called by a COM client returns a SafeArray with the F_OWNVALUE flag, a copy is created and returned instead, as the original SafeArray is automatically destroyed.
ja: COMクライアントから呼び出された関数やメソッドがF_OWNVALUEフラグを持つSafeArrayを返す場合、元のSafeArrayは自動的に破棄されるため、代わりにコピーが作成されて返されます。

source: When a function uses Exit to terminate the current thread, its caller does not receive a return value at all.
ja: 関数がExitを使用して現在のスレッドを終了させる場合、その呼び出し元は戻り値をまったく受け取りません。

source: When a hotkey is currently disabled via #HotIf, its key or mouse button will appear with a "#" character in KeyHistory's "Type" column.
ja: ホットキーが#HotIfによって現在無効になっている場合、そのキーまたはマウスボタンは、KeyHistoryの「Type」列に「#」文字で表示されます。

source: When a hotkey is first created -- either by the Hotkey function or the double-colon syntax in the script -- its key name and the ordering of its modifier symbols becomes the permanent name of that hotkey, shared by all variants of the hotkey.
ja: ホットキーが最初に作成されたとき（Hotkey関数またはスクリプトのダブルコロン構文）、そのキー名と修飾記号の順序がそのホットキーの永続的な名前になり、そのホットキーのすべてのバリエーションで共有されます。

source: When a hotkey is first created -- either by the Hotkey function or the double-colon syntax in the script -- its key name and the ordering of its modifier symbols becomes the permanent name of that hotkey as reflected by A_ThisHotkey and Action's parameter.
ja: ホットキーが最初に作成されたとき（Hotkey関数またはスクリプトのダブルコロン構文による）、そのキー名と修飾記号の順序が、A_ThisHotkeyと Actionのパラメータに反映されて、そのホットキーの永久名称となります。

source: When a hotkey is triggered, the name of the hotkey is passed as its first parameter named ThisHotkey (which excludes the trailing colons).
ja: ホットキーがトリガーされると、ホットキーの名前がThisHotkeyという最初のパラメータとして渡されます（末尾のコロンは除外されます）。

source: When a hotstring is first created -- either by the Hotstring function or a double-colon label in the script -- its trigger string and sequence of option characters becomes the permanent name of that hotstring.
ja: Hotstring関数またはスクリプト内のダブルコロンラベルによってホットストリングが最初に作成されると、そのトリガー文字列とオプション文字のシーケンスが、そのホットストリングの永続的な名前になる。

source: When a hotstring is first created -- either by the Hotstring function or the double-colon syntax in the script -- its trigger string and sequence of option characters becomes the permanent name of that hotstring as reflected by ThisHotkey.
ja: Hotstring関数またはスクリプトのダブルコロン構文でホットストリングを最初に作成すると、そのトリガー文字列とオプション文字のシーケンスが、ThisHotkeyに反映されるそのホットストリングの永久的な名前となります。

source: When a hotstring is triggered, the name of the hotstring is passed as its first parameter named ThisHotkey (which excludes the trailing colons).
ja: ホットストリングがトリガーされると、ホットストリングの名前がThisHotkeyという最初のパラメータとして渡されます（末尾のコロンを除いたものです）。

source: When a key is held down via the method above, it does not begin auto-repeating like it would if you were physically holding it down (this is because auto-repeat is a driver/hardware feature).
ja: 上記の方法でキーを押した場合、物理的に押した場合のようにオートリピートが始まるわけではありません（オートリピートはドライバー/ハードウェアの機能であるためです）。

source: When a key is specified by name, the options are set either by VK or by SC.
ja: キーが名前で指定されている場合、オプションはVKまたはSCで設定されます。

source: When a keyboard key is being remapped to become a mouse button (e.g. RCtrl::RButton), the hotkeys above use SetMouseDelay in place of SetKeyDelay.
ja: キーボードのキーがマウスボタンにリマップされる場合（例：RCtrl::RButton）、上記のホットキーはSetKeyDelayの代わりにSetMouseDelayを使用します。

source: When a list-view control uses this style, the LVN_GETINFOTIP notification message is sent to the parent window before displaying an item's ToolTip.
ja: リストビューコントロールがこのスタイルを使用する場合、項目のツールチップを表示する前にLVN_GETINFOTIP通知メッセージが親ウィンドウに送られます。

source: When a mouse or keyboard hotkey is disabled via #HotIf, it performs its native function; that is, it passes through to the active window as though there is no such hotkey.
ja: マウスやキーボードのホットキーが#HotIfによって無効化されると、本来の機能を発揮します。つまり、そのようなホットキーがないかのように、アクティブウィンドウに通過します。

source: When a mouse or keyboard hotkey is disabled via a HotIf function or directive, it performs its native function; that is, it passes through to the active window as though there is no such hotkey.
ja: HotIf関数やディレクティブによってマウスやキーボードのホットキーが無効にされると、その本来の機能を実行します。つまり、そのようなホットキーがないかのようにアクティブウィンドウに通過します。

source: When a number is converted to a string, it is formatted as decimal.
ja: 数値を文字列に変換した場合、10進数でフォーマットされます。

source: When a parameter is marked ByRef, any attempt to explicitly pass a non-VarRef value causes an error to be thrown.
ja: パラメータがByRefとマークされている場合、VarRef以外の値を明示的に渡そうとすると、エラーが発生します。

source: When a region is set for a window owned by the script, the system may automatically change the method it uses to render the window's frame, thereby altering its appearance.
ja: スクリプトが所有するウィンドウに領域が設定されると、システムはウィンドウのフレームをレンダリングするために使用する方法を自動的に変更し、それによってウィンドウの外観を変更することがあります。

source: When a row is selected, all its fields are highlighted.
ja: 行を選択すると、その行のすべてのフィールドが強調表示される。

source: When a script first uses this function, the mouse hook is installed (if it is not already).
ja: スクリプトがこの機能を初めて使用するとき、マウスフックがインストールされます（まだインストールされていない場合）。

source: When a script is launched, each remapping is translated into a pair of hotkeys.
ja: スクリプトが起動すると、各リマッピングはホットキーのペアに変換されます。

source: When a script's hotkeys are suspended, its tray icon changes to (or to if the script is also paused).
ja: スクリプトのホットキーが一時停止されると、トレイアイコンが に変わります（スクリプトも一時停止されている場合は に変わります）。

source: When a static initializer calls other functions with static variables, there is less risk of initializers having not executed yet due to the order of the function definitions.
ja: 静的イニシャライザが静的変数を持つ他の関数を呼び出す場合、関数定義の順序によりイニシャライザが未実行となる危険性が少ないです。

source: When a value is required to be either true or false, a blank or zero value is considered false and all other values are considered true.
ja: 値が真か偽のどちらかであることが要求される場合、空白またはゼロの値は偽とみなされ、他のすべての値は真とみなされます。

source: When a value is thrown from within a Try block or a function called by one, the following occurs:
ja: Tryブロックまたはそれに呼び出された関数の内部から値がスローされると、以下のことが起きます：

source: When a variable is given a new string longer than its current contents, additional system memory is allocated automatically.
ja: 変数に現在の内容より長い新しい文字列が与えられると、追加のシステム・メモリが自動的に割り当てられる。

source: When a variable is passed directly, the address of the variable's internal string buffer is no longer used.
ja: 変数を直接渡す場合、その変数の内部文字列バッファのアドレスは使用されなくなります。

source: When a variable is referenced but not used as the target of an assignment or the reference operator (&var).
ja: 変数が参照されているが、代入や参照演算子（&var）の対象として使用されていない場合。

source: When a variable's string address (e.g. StrPtr(MyVar)) is passed to a function and that function alters the length of the variable's contents, subsequent uses of the variable may behave incorrectly.
ja: 変数の文字列アドレス（StrPtr(MyVar)など）が関数に渡され、その関数が変数の内容の長さを変更した場合、その変数のその後の使用が正しく動作しないことがあります。

source: When a variadic function is called, surplus parameters can be accessed via an object which is stored in the function's final parameter.
ja: 可変型関数が呼び出されると、関数の最終パラメータに格納されているオブジェクトを介して、余剰パラメータにアクセスすることができます。

source: When a window is activated immediately after another window was activated, task bar buttons may start flashing on some systems (depending on OS and settings).
ja: 他のウィンドウを起動した直後にウィンドウを起動した場合、一部のシステムでタスクバーのボタンが点滅し始めることがあります（OSや設定により異なります）。
